text/10-semantic-tableaux.org
#+title: Chapter 10: Semantic Tableaux

* <<intro>>
The previous chapter has shown how continuations, implemented by procedures as parameters, can be used as a backtracking mechanism in order to explore alternatives presented by a regular expression.  In this chapter the same technique is used again, this time to explore alternative ways of making a formula false while determining whether it is a tautology.  In addition, there is a top down method for parsing and translating which does not use recursive descent.

* TRUTH TABLES VERSUS SEMANTIC TABLEAUX

One way of determining whether a formula is a tautology it to first do a truth table and then search this table for lines in which the formula is false.  If there are any such lines, then the formula is not a tautology.  Another way of determining whether a formula is a tautology is to attempt to find such lines without doing the entire table.  Using the formula itself as a kind of program one can attempt to find the lines in a top down manner.  The method is described in most modern logic text books, under the name of /truth trees/ or /semantic tableaux/.  To avoid confusion with the other uses of the word "tree" in this book, the term "semantic tableaux" will be used here.  For expositions, see any one of

- Jeffrey (1967, pp 63 - 79),
- Gustason and Ulrich (1973, pp 251 - 262),
- Richards (1978, pp 174 - 189),
- Halpin and Girle (1981, pp 153 - 180),
- or the rather theoretical Smullyan (1968, pp 15 - 24).

The program that we shall write in this chapter uses this method.

The program repeatedly reads formulas of propositional logic in infix notation with operator precedences for the infix operators.  For each formula read it tries to find countermodels - assignments of values to the propositional variables which will make the formula false.  If there are no countermodels, the program reports that the formula is a tautology.  If there are countermodels, the program reports that the formula is not a tautology and then proceeds to list the countermodels, one per line; a countermodel is specified as a list of propositional variables preceded by "+" to indicate truth or "-" to indicate falsity in the countermodel.

The following is a (simulated) record of an interactive session with the program:

#+begin_src pascal
?-    p v q v -r.
not tautology,  countermodels:
1:   -p -q +r
?-    p & q & -r.
not tautology,  countermodels:
1:   -p
2:   -q
3:   +r
?-    (p v q) & (p > r) & (q > s)  >  (r v s).
tautology
?-    (p v q) & (p > r) & (q > s)  >  (r & s).
not tautology,  countermodels:
1:   +p -q +r -s
2:   -p +q -r +s
?-    p & (q v r)  =  (p & q) v (p & r).
tautology
?-    (1 & 0) v 1.
tautology
?-    0.
not tautology,  countermodels:
#+end_src

* DESIGNING THE IMPLEMENTATION

As for most of our previous programs,
the implementation falls naturally into two parts:
1) translating the external representation of the input
into a suitable internal form, and 2) interpreting the internal form of the formula either to generate countermodels if there are any, or to report that there are no countermodels.

** A Goal Stack Machine

What the translator has to do is entirely familiar by now: reading characters from the input file, it has to check that the characters constitute a well-formed formula.  During the reading and checking it has to generate an internal representation of the formula in the form of a binary tree.  Reading characters and detecting errors for infix formulas with operator precedences was first done in our truth table generator (in Chapter 5), generating binary trees was first done in our simple language with types and procedures (in Chapter 7).  It would be a simple matter to adapt the recursive descent parser from the truth table program to produce binary trees as internal code.

But for variety we shall now study another technique for parsing and translating which does not use recursive descent.  This technique is still a top down method, in the sense that at all times the parser knows what it expects next, but it does not use recursion.  Instead the recursion is simulated in a simple way using an explicit stack.

We have seen an explicit stack already in the evaluator part of the truth table program, where it served the same purpose as the recursive evaluators in Chapters 3 and 7.  The explicit stack contained Boolean values, and what happened to the stack was under the control of a formula in internal postfix notation.  Such stacks of values need not be of type Boolean, they can be of type character or integer or real or of various other types.  Such a stack need not contain values only, it can contain addresses to be saved and later restored.  One very sophisticated kind of stack is the run-time stack of ALGOL-like languages.  (For some advance reading, see the end of Chapter 14.)  What is important for our purposes is that in these kinds of stacks the behaviour is controlled by something external to the stack - a postfix formula, or more generally any postfix expression that is to be evaluated, or more general still, a program to be executed.

The stack we use here is quite different, it is not a passive receptacle of data values but an active structure which itself controls behaviour.  In more detail, it is always the element on the top of the stack which determines what is to happen next.  In the most general form the stack represents outstanding tasks to be done or goals to be achieved, either directly or by doing sub-tasks or achieving sub-goals.  The most general structure of such a stack architecture is this:

#+begin_src pascal
	push a single goal onto an otherwise empty stack;
	REPEAT
	    CASE top goal on the stack OF
		something simple and atomic:
		    pop this goal and
		    do what is appropriate;
		something complex:
		    pop this goal and
		    push one or more simpler goals
		END (* CASE *)
	    UNTIL the stack is empty
#+end_src

The goals can be all sorts of things, and there is no presupposition that they concern parsing or translating or evaluating.  Indeed, any program with procedure calls can be rewritten in this form, even if the calls are recursive or mutually recursive.

