10-semantic-tableaux.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 10: Semantic Tableaux</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Chapter 10: Semantic Tableaux"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-11 07:38:02 CST"/>
<meta name="author" content="michal"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Chapter 10: Semantic Tableaux</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 intro</a></li>
<li><a href="#sec-2">2 TRUTH TABLES VERSUS SEMANTIC TABLEAUX</a></li>
<li><a href="#sec-3">3 DESIGNING THE IMPLEMENTATION</a>
<ul>
<li><a href="#sec-3-1">3.1 A Goal Stack Machine</a></li>
<li><a href="#sec-3-2">3.2 Predictive Parsing On A Stack</a></li>
<li><a href="#sec-3-3">3.3 Step 1: <i>Parsing</i>.</a></li>
<li><a href="#sec-3-4">3.4 Translating On A Stack</a></li>
<li><a href="#sec-3-5">3.5 Step 2: <i>Generating Postfix</i>.</a></li>
<li><a href="#sec-3-6">3.6 Step 3: <i>Tree Code</i>.</a></li>
<li><a href="#sec-3-7">3.7 The Model Generator</a></li>
</ul>
</li>
<li><a href="#sec-4">4 The Program</a></li>
<li><a href="#sec-5">5 Exercises and Reading</a>
<ul>
<li><a href="#sec-5-1">5.1 <i>A puzzle</i>:</a></li>
<li><a href="#sec-5-2">5.2 <i>Another implementation</i>:</a></li>
<li><a href="#sec-5-3">5.3 <i>Translation to Prefix</i>:</a></li>
<li><a href="#sec-5-4">5.4 <i>Tree Code in Infix Order</i>:</a></li>
<li><a href="#sec-5-5">5.5 <i>A simpler program</i>:</a></li>
<li><a href="#sec-5-6">5.6 <i>Non-recursive model generator</i>:</a></li>
<li><a href="#sec-5-7">5.7 <i>Deadlock and  Reachability in Petri Nets</i>:</a></li>
<li><a href="#sec-5-8">5.8 <i>Optimisation</i>:</a></li>
<li><a href="#sec-5-9">5.9 <i>Other methods</i>:</a></li>
<li><a href="#sec-5-10">5.10 <i>Three valued logic</i>:</a></li>
<li><a href="#sec-5-11">5.11 <i>Tautological Entailment</i>:</a></li>
<li><a href="#sec-5-12">5.12 <i>For Reflection</i>:</a></li>
<li><a href="#sec-5-13">5.13 <i>Reading</i>:</a></li>
</ul>
</li>
<li><a href="#sec-6">6 The Identity Calculus</a></li>
<li><a href="#sec-7">7 <i>Exercise</i>:</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="target">intro</span></h2>
<div class="outline-text-2" id="text-1">

<p>The previous chapter has shown how continuations, implemented by procedures as parameters, can be used as a backtracking mechanism in order to explore alternatives presented by a regular expression.  In this chapter the same technique is used again, this time to explore alternative ways of making a formula false while determining whether it is a tautology.  In addition, there is a top down method for parsing and translating which does not use recursive descent.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> TRUTH TABLES VERSUS SEMANTIC TABLEAUX</h2>
<div class="outline-text-2" id="text-2">


<p>
One way of determining whether a formula is a tautology it to first do a truth table and then search this table for lines in which the formula is false.  If there are any such lines, then the formula is not a tautology.  Another way of determining whether a formula is a tautology is to attempt to find such lines without doing the entire table.  Using the formula itself as a kind of program one can attempt to find the lines in a top down manner.  The method is described in most modern logic text books, under the name of <i>truth trees</i> or <i>semantic tableaux</i>.  To avoid confusion with the other uses of the word "tree" in this book, the term "semantic tableaux" will be used here.  For expositions, see any one of
</p>
<ul>
<li>Jeffrey (1967, pp 63 - 79),
</li>
<li>Gustason and Ulrich (1973, pp 251 - 262),
</li>
<li>Richards (1978, pp 174 - 189),
</li>
<li>Halpin and Girle (1981, pp 153 - 180),
</li>
<li>or the rather theoretical Smullyan (1968, pp 15 - 24).
</li>
</ul>


<p>
The program that we shall write in this chapter uses this method.
</p>
<p>
The program repeatedly reads formulas of propositional logic in infix notation with operator precedences for the infix operators.  For each formula read it tries to find countermodels - assignments of values to the propositional variables which will make the formula false.  If there are no countermodels, the program reports that the formula is a tautology.  If there are countermodels, the program reports that the formula is not a tautology and then proceeds to list the countermodels, one per line; a countermodel is specified as a list of propositional variables preceded by "+" to indicate truth or "-" to indicate falsity in the countermodel.
</p>
<p>
The following is a (simulated) record of an interactive session with the program:
</p>



<pre class="example">?-    p v q v -r.
not tautology,  countermodels:
1:   -p -q +r
?-    p &amp; q &amp; -r.
not tautology,  countermodels:
1:   -p
2:   -q
3:   +r
?-    (p v q) &amp; (p &gt; r) &amp; (q &gt; s)  &gt;  (r v s).
tautology
?-    (p v q) &amp; (p &gt; r) &amp; (q &gt; s)  &gt;  (r &amp; s).
not tautology,  countermodels:
1:   +p -q +r -s
2:   -p +q -r +s
?-    p &amp; (q v r)  =  (p &amp; q) v (p &amp; r).
tautology
?-    (1 &amp; 0) v 1.
tautology
?-    0.
not tautology,  countermodels:
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> DESIGNING THE IMPLEMENTATION</h2>
<div class="outline-text-2" id="text-3">


<p>
As for most of our previous programs,
the implementation falls naturally into two parts:
</p><ol>
<li>translating the external representation of the input
</li>
</ol>

<p>into a suitable internal form, and 2) interpreting the internal form of the formula either to generate countermodels if there are any, or to report that there are no countermodels.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> A Goal Stack Machine</h3>
<div class="outline-text-3" id="text-3-1">


<p>
What the translator has to do is entirely familiar by now: reading characters from the input file, it has to check that the characters constitute a well-formed formula.  During the reading and checking it has to generate an internal representation of the formula in the form of a binary tree.  Reading characters and detecting errors for infix formulas with operator precedences was first done in our truth table generator (in Chapter 5), generating binary trees was first done in our simple language with types and procedures (in Chapter 7).  It would be a simple matter to adapt the recursive descent parser from the truth table program to produce binary trees as internal code.
</p>
<p>
But for variety we shall now study another technique for parsing and translating which does not use recursive descent.  This technique is still a top down method, in the sense that at all times the parser knows what it expects next, but it does not use recursion.  Instead the recursion is simulated in a simple way using an explicit stack.
</p>
<p>
We have seen an explicit stack already in the evaluator part of the truth table program, where it served the same purpose as the recursive evaluators in Chapters 3 and 7.  The explicit stack contained Boolean values, and what happened to the stack was under the control of a formula in internal postfix notation.  Such stacks of values need not be of type Boolean, they can be of type character or integer or real or of various other types.  Such a stack need not contain values only, it can contain addresses to be saved and later restored.  One very sophisticated kind of stack is the run-time stack of ALGOL-like languages.  (For some advance reading, see the end of Chapter 14.)  What is important for our purposes is that in these kinds of stacks the behaviour is controlled by something external to the stack - a postfix formula, or more generally any postfix expression that is to be evaluated, or more general still, a program to be executed.
</p>
<p>
The stack we use here is quite different, it is not a passive receptacle of data values but an active structure which itself controls behaviour.  In more detail, it is always the element on the top of the stack which determines what is to happen next.  In the most general form the stack represents outstanding tasks to be done or goals to be achieved, either directly or by doing sub-tasks or achieving sub-goals.  The most general structure of such a stack architecture is this:
</p>



<pre class="example">push a single goal onto an otherwise empty stack;
REPEAT
    CASE top goal on the stack OF
        something simple and atomic:
            pop this goal and
            do what is appropriate;
        something complex:
            pop this goal and
            push one or more simpler goals
        END (* CASE *)
    UNTIL the stack is empty
</pre>


<p>
The goals can be all sorts of things, and there is no presupposition that they concern parsing or translating or evaluating.  Indeed, any program with procedure calls can be rewritten in this form, even if the calls are recursive or mutually recursive.
</p>
</div>

</div>
