text/10-semantic-tableaux.org
** Predictive Parsing On A Stack

In earlier chapters we have seen again and again that it is profitable to think of the development of a translator in two stages: first we design a parser, second we augment it to become a translator.  We shall follow the same pattern here.  For parsing the goals that can be put onto the stack are derived from the grammar - and for our current purpose it is a grammar for logical formulas in infix notation with different precedences for the infix operators.  The method can easily be adapted to parsing many other kinds of grammars.  The starting symbol of the grammar is the initial single goal to be pushed onto the stack, so for our grammar it is the goal of parsing a formula.  We now have to describe the way the stack machine is to operate for various goals on the stack.

** Step 1: /Parsing/.
Following the grammar, we see that a formula consists of an expression followed optionally by one of two operators and another formula.  So if the top goal is to parse a formula, this goal is to be achieved by parsing an expression and an optional second part of a formula.  These two subgoals have to replace the top goal in such a way that parsing an expression is attempted first, and that parsing the optional second part of a formula is attempted next.  The first goal that will be attempted is the one to be found on the top of the stack.  So, after popping the goal to parse a formula, we must first push the goal of parsing the second part of a formula, and then push the goal of parsing an expression.  For the goals of parsing an expression or a term the pattern is similar: after popping the goal of parsing an expression we must first push the goal of parsing the second part of an expression and then push the goal of parsing a term, and after popping the goal of parsing a term we must first push the goal of parsing the second part of a term and then push the goal of parsing a factor.

For the remaining goals the behaviour is in part dependent on the current input character.  In the case of the factor goal, the permitted cases can be read from the grammar: If the current character is a lower case letter, a propositional variable, then we pop the factor goal and get the next character.  If the character is '-', the negation operator, we pop the factor goal, get the next character and push another factor goal.  The reason for first popping and then pushing the same goal again will be seen later when we come to translation.  If the current character is a left parenthesis, we pop the factor goal, get the next character, push the goal to check for a closing right parenthesis and then push the goal to parse a formula.  If the current character is none of these, then an error is reported.  This concludes the factor goal.  The goal of checking for a right parenthesis does this: if the current character is a right parenthesis then we get the next character, otherwise an error has to be reported.

The remaining goals concern the second parts of formula, expression and term.  All three depend on the current character being appropriate for the second part.  If the character is not appropriate, then the goal of parsing this second part is simply popped, otherwise some action has to be taken.  In the case of the second part of formula we must pop the current goal, get the next character and push the goal of parsing a formula.  In the case of parsing the second parts of expression and term the situation is similar: pop the goal, get the next character, for the second part of expression push term and for the second part of term push factor.  But this is not quite right yet, because for the second parts of expression and term we have to simulate two WHILE loops of the recursive descent parser: if after parsing the goals that have just been pushed the current input character is still appropriate, then the same cycle has to be repeated.  The only way to achieve this in a stack machine is to push the goal of possibly repeating a second part again, and this goal is exactly the same as the goal that has just been popped.  Hence, after popping the goal of parsing the second part of expression, we must first push this same goal and only then push the goal of parsing a term.  Similarly, after popping the goal of parsing the second part of term, we must first push this same goal and only then push the goal of parsing a factor.

This concludes the predictive parser for logical formulas in infix notation with operator precedences.  When a formula has been read, the stack will now be empty.  The check for the terminating period is best done after exit from the stack machine.  There are some obvious opportunities for optimising several POP-PUSH pairs, but you are advised to get the structure right first.

** Translating On A Stack

We have seen how to get the general goal stack architecture to do parsing, and now we shall extend it to do translating.  The internal notation that we have to translate to is tree code, consisting of nodes which are records containing an operator field and two integer pointer fields.  Initially we concentrate on generating code with just the operator field.  This will look just like postfix notation, and it has to be generated in the same way.  For the goals of parsing a formula, an expression or a term no code is generated, although there may be code generated for their second parts.

