10-semantic-tableaux.html

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Step 2: <i>Generating Postfix</i>.</h3>
<div class="outline-text-3" id="text-3-5">

<p>We begin with generating code for factors.  A factor consisting of just a lower case letter is translated into itself, so all that is needed is a call to the code generating procedure which at this stage merely takes one character parameter which will be the operator of the code to be generated.  A factor consisting of a parenthesised formula does not generate any code apart from the code generated by the enclosed formula.  But for factors which consist of a negated factor the code generation becomes a little more difficult, because the negation operator of the translation has to be generated after the code for the operand factor has been generated.  To achieve this behaviour, before pushing the goal to parse another factor we must push the goal to generate a negation operator for the translation.  Such pushing of goals to generate code will occur elsewhere, and it will be cleanest if there is only one kind of goal having to do with code generation.  That goal will then have to know which operator to generate, and the easiest way is to put the operator to be generated right beside it in the stack.  This will mean that the stack no longer consists merely of goals to be achieved, but each element of the stack will be a record consisting of a goal and an operator - and it is only the code generating goal which ever makes use of the operator.  Hence for factors consisting of negated factors we must: pop the current goal of parsing a factor, get the next character, push the goal of generating code with negation in the operator field, and push the goal of parsing another factor.
</p>
<p>
The other kind of code generation has to occur when infix operators are encountered.  They are detected by the second parts of formula, expression and term, and the relevant code has to be generated after the pushed subgoals of formula, term and factor have been achieved.  So for all three goals of achieving these second parts, a goal to generate the relevant code has to be pushed before the final goal of formula, term and factor is pushed.  So, in the case of the second part of formula, the goal to be pushed is that of generating whichever of '&gt;' or '=' triggered the execution of the second part.  In the case of the second part of expression, the goal to be pushed is that of generating '#', and not 'v' which triggered the second part.  In the case of the second part of term, the goal to be pushed is that of generating '<sub>&amp</sub>;' which also triggered the execution of this second part.
</p>
<p>
The above pushing of a goal to generate code will eventually bring this goal to the top where it has to be executed - just as inside factor for generating atomic code we call the code generating routine to generate the operator which is to be found right beside the goal to generate code.  This concludes the code generation for just the operators and operands, and it produces code in postfix order.
</p>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Step 3: <i>Tree Code</i>.</h3>
<div class="outline-text-3" id="text-3-6">

<p>But we need more than just postfix code, we need a binary tree of records containing an operator field and two integer pointer fields.  The code generating procedure now needs two extra parameters whose values become the new fields.  The records do not actually have to be generated in postfix order, as long as the pointer fields are correct.  For atoms in factors, the two extra fields are not needed, so they can be set to anything.  But we must augment the code generation to include the required pointers in the case of those operators where the pointers do indeed point to a subformula.  This is the case for the negation operator and each of the four infix operators.  The postfix order is particularly convenient here, because when the code for the operator is generated, the code for the subformulas has been generated already and the required values of the pointers are known - or at least they were known once and might have been forgotten.  For the right pointer field there is nothing to forget, the required value is always the last code that has been generated.  Since for negation the only pointer needed is the right pointer, the goal of generating code just uses the last generated code as the parameter for the right pointer, and it does not matter what for the left pointer.
</p>
<p>
However, for the infix operators there is a problem already encountered in recursive descent translating.  The code for the left subformula has been generated a while before the code for the infix operator is generated, and in the recursive descent method we used a local variable to save the pointer to the code for the left subformula.  We cannot use a local variable in the stack machine, instead we have to save the pointer to the left subformula on some stack.  And what better stack to use than the goal stack, which apart from goals already contains operators for code generation.  So we add another field for saving pointers to left subformulas.  The goal to generate code now has to call the code generating routine, using as the three parameters the operator which it finds in the operator field of the stack, the pointer which it finds in the new field for saved pointers to left subformulas, and the last code index.  Only one more item needs changing.  Inside the goal cases for parsing the second parts of formula, expression and term, the pushing of a goal to generate code has to include not just the relevant operator, but also a pointer to the last read left subformula, and that is in the last code index.  This concludes the code generation.
</p>
</div>

</div>
