text/10-semantic-tableaux.org
** The Model Generator

The code that has been generated while reading a formula now has to be processed by a procedure which attempts to falsify the formula - if this fails, then the formula is a tautology, if it succeeds then the formula is not a tautology and the program has to write out all ways of falsifying the formula which it can find.

Since formulas can be conjunctions, disjunctions, and, in particular, negations, a method is needed for falsifying negations, which is the same as verifying the negand.  The simplest method is to have two procedures, for verifying and for falsifying, called /ver/ and /fal/; the two procedures are duals of each other.  It so turns out that /ver/ is a little easier to design initially.  Inside /ver/ the control structures needed for implementing conjunction and disjunction are identical to the control structures for concatenation and alternation in the regular expression expander of Chapter 9.  For negations the dual procedure /fal/ is called with the negand as the formula parameter.  At any one time in the model generation a particular atom can be true or false or neither.  One way of implementing this is to have two sets, the true variables and the false variables, with both sets initially empty.  Inside /ver/, to make an atom true we must check whether it is already in the set of false variables, If it is, the path is closed, and no further attempt is made to continue this path.  If it is not, then it may be already in the set of true variables or it may not be.  In either case we call the continuation procedure with the atom added to the set of true variables.  The simplest way is to give each of the model generating procedures two parameters /t/ and /f/ for the two sets.  The following is an outline of procedure /ver/:

#+begin_src pascal
.TEST PAGE 3
TYPE vs = SET OF 'a' .. 'z';

PROCEDURE show(t,f : vs):
BEGIN write the members of t and f END;
.TEST PAGE 5

PROCEDURE ver(n : tree; PROCEDURE cp(t,f : vs); t,f : vs);

    PROCEDURE ver_right(t,f : vs);
    BEGIN ver(right of n, cp, t,f) END;
.TEST PAGE 8

BEGIN (* ver *)
CASE operator of n OF
    and  : ver(left of n, ver_right, t,f)
    or   : ver(left of n, cp, t,f); ver(right of n, cp, t,f)
    not  : fal(right of n, cp, t,f)
    atom : IF the atom is not in f THEN cp(t + the atom, f)
END; (* ver *)
#+end_src

The two other binary operations and the two Boolean constants are treated analogously, and procedure /fal/ for falsifying a formula is just the dual of /ver/.  This high level description should be adequate for implementing the two procedures.  In the main program, after a formula has been read, the required call is:

#+begin_src pascal
	fal(the formula that has been read, show, [],[])
#+end_src

To make the interpretation slightly more efficient, the parser and the translator depart from the grammar in inessential ways to obtain right linear tree code.  The details were already explained in the previous chapter.

* The Program

I am still using the material of this Chapter in a course.  So this version of the notes does not include the sources.  The source will probably be made available towards the end of 2003.

* Exercises and Reading

** /A puzzle/:
In Shakespeare's "The Merchant of Venice" the lovely Portia requires her suitors to solve this puzzle.  She has three caskets, made of gold, silver and lead, respectively.  One of them contains her portrait.  Each casket has an inscription on the outside - gold: "the portrait is in this casket", silver: "the portrait is not in this casket", and lead: "the portrait is not in the gold casket".  At most one inscription is true.  Use the tableau program to determine which casket contains her portrait.

** /Another implementation/:
Schagrin, Rapaport and Dipert (1985, pp 120 - 123) give what they call Wang's algorithm, essentially the same as the tableau method used here.  Compare their method with the program written in this chapter.

** /Translation to Prefix/:
Replace the two procedures for verifying and falsifying a formula by a single (recursive) procedure which traverses the internal tree code and writes a translation of the input formula into prefix notation or into Cambridge notation (see see the exercises at the end of Chapter 2).  Note that the entire translation from visible source to visible target is now a two stage process.

** /Tree Code in Infix Order/:
It is not necessary that the individual records of the tree code are generated in postfix order, instead they can be generated in infix order.  But then the required right address is not known at the time they are generated, and they will have to be fixed up when they are known.  Change the internal tree code generation so that it generates the tree code in infix order by pushing goals to do fixups.

** /A simpler program/:
1) Replace the two procedures /ver/ and /fal/ by a single procedure which takes an additional Boolean parameter representing whether the formula is to be made true or false.  Thus /ver(..)/ is replaced by /make(true,..)/, and /fal(..)/ is replaced by /make(false,..)/.

2) remove the parameters /t/ and /f/ from all the model generating procedures and achieve their effect by two global variables /t/ and /f/ or by one ARRAY [boolean] OF SET OF 'a' .. 'z'. The Boolean parameter of /make/ is useful as an index into this ARRAY.

** /Non-recursive model generator/:
The non-recursive parser in this program shows that recursive descent can be replaced by an explicit stack machine.  Attempt to design a non-recursive explicit stack machine which does the work of the model generator.  You might think that you need two stacks, one for verifying conjunctions and one for verifying disjunctions, and dually for falsifying.  However, do keep in mind that the second order recursive solution does manage with just one stack, the PASCAL runtime stack.

** /Deadlock and  Reachability in Petri Nets/:
(This assumes you have read the exercise in Chapter 5.)  Adapt the program so that it can read a description of a Petri net and determine

1) which markings produce deadlock,
2) which markings are unreachable, and
3) which reachable markings produce deadlock.

You will have to design your own little language for describing nets.  For some more ideas, see Chapter 20, but you could design a description language which only uses single characters as symbols.

** /Optimisation/:
Every textbook on tableaux recommends: "Delay Branching!", i.e. do trunking rules before branching rules.  Implement this optimisation; collect some timing measurements to see how much is really saved.

