10-semantic-tableaux.html

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> The Model Generator</h3>
<div class="outline-text-3" id="text-3-7">


<p>
The code that has been generated while reading a formula now has to be processed by a procedure which attempts to falsify the formula - if this fails, then the formula is a tautology, if it succeeds then the formula is not a tautology and the program has to write out all ways of falsifying the formula which it can find.
</p>
<p>
Since formulas can be conjunctions, disjunctions, and, in particular, negations, a method is needed for falsifying negations, which is the same as verifying the negand.  The simplest method is to have two procedures, for verifying and for falsifying, called <i>ver</i> and <i>fal</i>; the two procedures are duals of each other.  It so turns out that <i>ver</i> is a little easier to design initially.  Inside <i>ver</i> the control structures needed for implementing conjunction and disjunction are identical to the control structures for concatenation and alternation in the regular expression expander of Chapter 9.  For negations the dual procedure <i>fal</i> is called with the negand as the formula parameter.  At any one time in the model generation a particular atom can be true or false or neither.  One way of implementing this is to have two sets, the true variables and the false variables, with both sets initially empty.  Inside <i>ver</i>, to make an atom true we must check whether it is already in the set of false variables, If it is, the path is closed, and no further attempt is made to continue this path.  If it is not, then it may be already in the set of true variables or it may not be.  In either case we call the continuation procedure with the atom added to the set of true variables.  The simplest way is to give each of the model generating procedures two parameters <i>t</i> and <i>f</i> for the two sets.  The following is an outline of procedure <i>ver</i>:
</p>



<pre class="example">.TEST PAGE 3
TYPE vs = SET OF 'a' .. 'z';

PROCEDURE show(t,f : vs):
BEGIN write the members of t and f END;
.TEST PAGE 5

PROCEDURE ver(n : tree; PROCEDURE cp(t,f : vs); t,f : vs);

    PROCEDURE ver_right(t,f : vs);
    BEGIN ver(right of n, cp, t,f) END;
.TEST PAGE 8

BEGIN (* ver *)
CASE operator of n OF
    and  : ver(left of n, ver_right, t,f)
    or   : ver(left of n, cp, t,f); ver(right of n, cp, t,f)
    not  : fal(right of n, cp, t,f)
    atom : IF the atom is not in f THEN cp(t + the atom, f)
END; (* ver *)
</pre>


<p>
The two other binary operations and the two Boolean constants are treated analogously, and procedure <i>fal</i> for falsifying a formula is just the dual of <i>ver</i>.  This high level description should be adequate for implementing the two procedures.  In the main program, after a formula has been read, the required call is:
</p>



<pre class="example">fal(the formula that has been read, show, [],[])
</pre>


<p>
To make the interpretation slightly more efficient, the parser and the translator depart from the grammar in inessential ways to obtain right linear tree code.  The details were already explained in the previous chapter.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> The Program</h2>
<div class="outline-text-2" id="text-4">


<p>
I am still using the material of this Chapter in a course.  So this version of the notes does not include the sources.  The source will probably be made available towards the end of 2003.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Exercises and Reading</h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <i>A puzzle</i>:</h3>
<div class="outline-text-3" id="text-5-1">

<p>In Shakespeare's "The Merchant of Venice" the lovely Portia requires her suitors to solve this puzzle.  She has three caskets, made of gold, silver and lead, respectively.  One of them contains her portrait.  Each casket has an inscription on the outside - gold: "the portrait is in this casket", silver: "the portrait is not in this casket", and lead: "the portrait is not in the gold casket".  At most one inscription is true.  Use the tableau program to determine which casket contains her portrait.
</p>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <i>Another implementation</i>:</h3>
<div class="outline-text-3" id="text-5-2">

<p>Schagrin, Rapaport and Dipert (1985, pp 120 - 123) give what they call Wang's algorithm, essentially the same as the tableau method used here.  Compare their method with the program written in this chapter.
</p>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> <i>Translation to Prefix</i>:</h3>
<div class="outline-text-3" id="text-5-3">

<p>Replace the two procedures for verifying and falsifying a formula by a single (recursive) procedure which traverses the internal tree code and writes a translation of the input formula into prefix notation or into Cambridge notation (see see the exercises at the end of Chapter 2).  Note that the entire translation from visible source to visible target is now a two stage process.
</p>
</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> <i>Tree Code in Infix Order</i>:</h3>
<div class="outline-text-3" id="text-5-4">

<p>It is not necessary that the individual records of the tree code are generated in postfix order, instead they can be generated in infix order.  But then the required right address is not known at the time they are generated, and they will have to be fixed up when they are known.  Change the internal tree code generation so that it generates the tree code in infix order by pushing goals to do fixups.
</p>
</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> <i>A simpler program</i>:</h3>
<div class="outline-text-3" id="text-5-5">

<ol>
<li>Replace the two procedures <i>ver</i> and <i>fal</i> by a single procedure which takes an additional Boolean parameter representing whether the formula is to be made true or false.  Thus <i>ver(..)</i> is replaced by <i>make(true,..)</i>, and <i>fal(..)</i> is replaced by <i>make(false,..)</i>.

</li>
<li>remove the parameters <i>t</i> and <i>f</i> from all the model generating procedures and achieve their effect by two global variables <i>t</i> and <i>f</i> or by one ARRAY [boolean] OF SET OF 'a' .. 'z'. The Boolean parameter of <i>make</i> is useful as an index into this ARRAY.
</li>
</ol>


</div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> <i>Non-recursive model generator</i>:</h3>
<div class="outline-text-3" id="text-5-6">

<p>The non-recursive parser in this program shows that recursive descent can be replaced by an explicit stack machine.  Attempt to design a non-recursive explicit stack machine which does the work of the model generator.  You might think that you need two stacks, one for verifying conjunctions and one for verifying disjunctions, and dually for falsifying.  However, do keep in mind that the second order recursive solution does manage with just one stack, the PASCAL runtime stack.
</p>
</div>

</div>

<div id="outline-container-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> <i>Deadlock and  Reachability in Petri Nets</i>:</h3>
<div class="outline-text-3" id="text-5-7">

<p>(This assumes you have read the exercise in Chapter 5.)  Adapt the program so that it can read a description of a Petri net and determine
</p>
<ol>
<li>which markings produce deadlock,
</li>
<li>which markings are unreachable, and
</li>
<li>which reachable markings produce deadlock.
</li>
</ol>


<p>
You will have to design your own little language for describing nets.  For some more ideas, see Chapter 20, but you could design a description language which only uses single characters as symbols.
</p>
</div>

</div>

<div id="outline-container-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> <i>Optimisation</i>:</h3>
<div class="outline-text-3" id="text-5-8">

<p>Every textbook on tableaux recommends: "Delay Branching!", i.e. do trunking rules before branching rules.  Implement this optimisation; collect some timing measurements to see how much is really saved.
</p>
</div>

</div>
