10-semantic-tableaux.html

<div id="outline-container-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> <i>Other methods</i>:</h3>
<div class="outline-text-3" id="text-5-9">

<p>The semantic tableaux method is one of whole spectrum of automatic proof methods.  They differ in the extent to which a formula has to be preprocessed before being submitted to the theorem prover.  In the case of the semantic tableaux, there is no preprocessing at all, it is the formula itself that is submitted.  In what follows it will be easier if the theorem prover is taken to solve the satisfiability problem - finding lines in the truth table in which the formula is true.
</p>
<p>
At the other extreme of the spectrum is the <i>resolution</i> method which requires formulas to be transformed into <i>clausal</i> form - consisting of a conjunction in which each conjunct is a disjunction of atoms or negated atoms.  The method works by replacing two conjuncts by a new formula containing all the disjuncts from the original two conjuncts except for one atom from the first disjunct and its negation from the other disjunct.  If this process eventually results in a conjunct which is a degenerate disjunction of no disjuncts at all, then the original formula is not satisfiable.
</p>
<p>
Somewhere in the middle of the spectrum is the <i>matrix</i> method.  It requires formulas to be transformed into conjunctions of disjunctions &hellip; of conjunctions of disjunctions &hellip;  of atoms or negated atoms.  The method attempts to find a consistent path through the outer conjunction by picking a disjunct from each conjunct.  If that disjunct happens to be a conjunction, it does the same there.  When a path has been found, the original formula is satisfiable.
</p>
<p>
A discussion of the relationship between the three methods is given in BLaesius and Buerckert (1989, pp 67 - 103).  Implement either the matrix method or the resolution method.  For the latter you should be able to adopt the program in this chapter to translate from infix form to clausal form.
</p>
<p>
<i>Minimising Output</i>:
The tableaux method will often give several open paths where one would do.
For example,
the formula "p <sub>&amp</sub>; (p v q) <sub>&amp</sub>; -r <sub>&amp</sub>; (-r v -s)."
will yield four countermodels:
1: -p, 2: -p -q, 3: +r, 4: +r +s.
Clearly countermodels 1: and 3: are the only ones needed,
because between them they subsume the others.
Formalise this notion of what the needed countermodels are.
Then implement this in the program.
You will find it necessary NOT to output open paths when they
are found, but to collect them in a list (which is initially empty).
When a new open path is found,
compare it with the paths collected so far:
if it is subsumed by a path already collected then ignore it,
if it subsumes one path already collected then substitute it,
if it subsumes several paths already collected
then substitute one and delete the others,
otherwise add it to the list.
Output the list only at the very end.
Probably it is best to implement the list as an ARRAY,
and since the only important information about paths is
the SET of true or false atoms it contains,
you want an ARRAY of pairs of SETs.
</p>
<p>
If you are doing the exercise to translate into clausal form,
the minimisation just described will be useful there, too.
</p>
</div>

</div>

<div id="outline-container-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> <i>Three valued logic</i>:</h3>
<div class="outline-text-3" id="text-5-10">

<p>Write a semantic tableaux program for one of the three valued logics.  For a suitable exposition of the two main versions, see Konikowska, Tarlecki and Blikle (1988).
</p>
</div>

</div>

<div id="outline-container-5-11" class="outline-3">
<h3 id="sec-5-11"><span class="section-number-3">5.11</span> <i>Tautological Entailment</i>:</h3>
<div class="outline-text-3" id="text-5-11">

<p>Anderson and Belnap (1975, pp 150 - 162) define "A entails B" as a relation which holds iff when A and B are written as disjunctions of conjunctions of literals (atoms or negated atoms), for every disjunct of A there is some disjunct of B such that every literal in the disjunct of B is also a literal of the disjunct of A.  Dunn (1976) shows how to use "coupled" semantic tableaux to determine entailment.  The method lends itself to a modification of our tableaux program; especially if you have done the previous exercise.  A entails B iff each upper path (from A) covers some lower path (from B); where an upper path covers a lower path iff every literal in the lower path occurs in the upper path.  Note that paths do not close because of inconsistency.  For the implementation:
</p><ol>
<li>do all the lowers to get a list of sets of literals,
</li>
</ol>

<p>using just a make where the clause for atoms does not check for
consistency but always calls cp.
</p><ol>
<li>do the uppers, using as cp a test for inclusion of upper set
</li>
</ol>

<p>in one element of the list.
A "countermodel" then consists of an upper set which does not cover
any of the lower sets - print out the upper and all the lowers.
If there is no countermodel, then we have entailment.
</p>
</div>

</div>

<div id="outline-container-5-12" class="outline-3">
<h3 id="sec-5-12"><span class="section-number-3">5.12</span> <i>For Reflection</i>:</h3>
<div class="outline-text-3" id="text-5-12">

<p>Examine the PROCEDURE getch in all the previous programs, and see how it differs.
</p>
</div>

</div>

<div id="outline-container-5-13" class="outline-3">
<h3 id="sec-5-13"><span class="section-number-3">5.13</span> <i>Reading</i>:</h3>
<div class="outline-text-3" id="text-5-13">

<p>For some advanced treatment of the tableaux method, see Wallen (1986).
</p>

</div>
</div>

</div>
