text/10-semantic-tableaux.org
* The Identity Calculus

In the propositional calculus there are truth functional connectives and atomic propositions which may be constants or variables.  In this section we shall study a very simple form of predicate calculus, with individual constants and just one binary predicate and its negation.  Whereas in the propositional calculus an atomic formula has no parts at all, in the identity calculus an atomic formula does have parts, but they are not formulas.  In the identity calculus an atomic formula is of one of the forms "a = b" or "a # b", where "a" and "b" are /individual constants/.  Truth functionally compound formulas are built from atomic formulas just as in the propositional calculus.

An /interpretation/ of the propositional calculus is an assignment of truth values to the atomic formulas - essentially it is a line in the truth table.  An interpretation of the identity calculus has to be something rather different, although the net effect on formulas has to be that they will be true or false in an interpretation.  We define an interpretation of the identity calculus to be a set of things {x, y ..}, called the domain, together with a function which assigns to each individual constant "a" of the language an individual from this domain.  For two individual constants "a" and "b", the atomic formula "a = b" is /true in an interpretation/ if and only if the interpretation assigns the same individual in the domain to "a" and to "b", otherwise it is false.  Likewise, the atomic formula "a # b" is true in an interpretation if and only if the interpretation assigns different individuals in the domain to "a" and "b", otherwise it is false.  An interpretation which makes a formula true is also called a /model/ of the formula.  A formula that has a model is called /consistent/, otherwise it is inconsistent.  A formula is called a /logical truth/ if its negation is inconsistent.

The identity calculus can be used to express puzzles such as the following.

- "There are three animals, a dog, a cat and a canary.
- One of them is called 'brutus', one of them is called 'sylvestre', and one of them is called 'tweety'.
- One of them is young, one of them is old, and one of them is middling.
- The dog is not called 'brutus', and
- the animal called 'brutus' is not old, and
- the old animal is not the cat, and
- the cat is not called 'sylvestre', and
- the animal called 'sylvestre' is not young, and
- the young animal is not the canary, and
- the canary is not called 'tweety', and
- the animal called 'tweety' is not middling in age, and
- the animal that is middling in age is not the dog, and
- the dog is not old.

Which animal is called what and how old are they?"

* /Exercise/:

Write a program which implements the semantic tableaux method for the identity calculus.  Your program should allow identifiers as atomic propositions AND as names of individuals; though any particular identifier can be used inside a formula only as one or the other.  On the first occurrence of an identifier inside a formula the presence or absence of the identity symbol '=' or of the non-identity symbol '#' on the left or the right indicates whether the identifier is a name for an individual or a proposition.

When stating the information in the puzzle, one has to be careful to express assumptions which are implicit in the puzzle.  To get the program to solve the puzzle, the information has to be negated, and the program works by showing that this negation is not a logical truth.  Its answer then consists of a model (of three individuals: 1, 2, 3) which makes the negation false and hence makes the original information true.
