10-semantic-tableaux.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> The Identity Calculus</h2>
<div class="outline-text-2" id="text-6">


<p>
In the propositional calculus there are truth functional connectives and atomic propositions which may be constants or variables.  In this section we shall study a very simple form of predicate calculus, with individual constants and just one binary predicate and its negation.  Whereas in the propositional calculus an atomic formula has no parts at all, in the identity calculus an atomic formula does have parts, but they are not formulas.  In the identity calculus an atomic formula is of one of the forms "a = b" or "a # b", where "a" and "b" are <i>individual constants</i>.  Truth functionally compound formulas are built from atomic formulas just as in the propositional calculus.
</p>
<p>
An <i>interpretation</i> of the propositional calculus is an assignment of truth values to the atomic formulas - essentially it is a line in the truth table.  An interpretation of the identity calculus has to be something rather different, although the net effect on formulas has to be that they will be true or false in an interpretation.  We define an interpretation of the identity calculus to be a set of things {x, y ..}, called the domain, together with a function which assigns to each individual constant "a" of the language an individual from this domain.  For two individual constants "a" and "b", the atomic formula "a = b" is <i>true in an interpretation</i> if and only if the interpretation assigns the same individual in the domain to "a" and to "b", otherwise it is false.  Likewise, the atomic formula "a # b" is true in an interpretation if and only if the interpretation assigns different individuals in the domain to "a" and "b", otherwise it is false.  An interpretation which makes a formula true is also called a <i>model</i> of the formula.  A formula that has a model is called <i>consistent</i>, otherwise it is inconsistent.  A formula is called a <i>logical truth</i> if its negation is inconsistent.
</p>
<p>
The identity calculus can be used to express puzzles such as the following.
</p>
<ul>
<li>"There are three animals, a dog, a cat and a canary.
</li>
<li>One of them is called 'brutus', one of them is called 'sylvestre', and one of them is called 'tweety'.
</li>
<li>One of them is young, one of them is old, and one of them is middling.
</li>
<li>The dog is not called 'brutus', and
</li>
<li>the animal called 'brutus' is not old, and
</li>
<li>the old animal is not the cat, and
</li>
<li>the cat is not called 'sylvestre', and
</li>
<li>the animal called 'sylvestre' is not young, and
</li>
<li>the young animal is not the canary, and
</li>
<li>the canary is not called 'tweety', and
</li>
<li>the animal called 'tweety' is not middling in age, and
</li>
<li>the animal that is middling in age is not the dog, and
</li>
<li>the dog is not old.
</li>
</ul>


<p>
Which animal is called what and how old are they?"
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <i>Exercise</i>:</h2>
<div class="outline-text-2" id="text-7">


<p>
Write a program which implements the semantic tableaux method for the identity calculus.  Your program should allow identifiers as atomic propositions AND as names of individuals; though any particular identifier can be used inside a formula only as one or the other.  On the first occurrence of an identifier inside a formula the presence or absence of the identity symbol '=' or of the non-identity symbol '#' on the left or the right indicates whether the identifier is a name for an individual or a proposition.
</p>
<p>
When stating the information in the puzzle, one has to be careful to express assumptions which are implicit in the puzzle.  To get the program to solve the puzzle, the information has to be negated, and the program works by showing that this negation is not a logical truth.  Its answer then consists of a model (of three individuals: 1, 2, 3) which makes the negation false and hence makes the original information true.
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-11 07:38:02 CST</p>
<p class="author">Author: michal</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
